""" "
猴子第一天摘下若干个桃子，当即吃了一半，还不过瘾，又多吃了一个。第二天早上又将剩下
的桃子吃掉一半，又多吃了一个。以后每天早上都吃了前一天剩下的一半零一个。到第10天
早上想吃时，只剩下一个桃子了。求第一天共摘多少个桃子
"""

""" 
方法一：逆向思维，从第10天往前推算
第10天早上剩1个桃子
第9天早上剩(1+1)*2=4个桃子
第8天早上剩(4+1)*2=10个桃子
第7天早上剩(10+1)*2=22个桃子
第6天早上剩(22+1)*2=46个桃子
第5天早上剩(46+1)*2=94个桃子
第4天早上剩(94+1)*2=190个桃子
第3天早上剩(190+1)*2=382个桃子
第2天早上剩(382+1)*2=766个桃子
第1天早上剩(766+1)*2=1534个桃子
方法二：递归函数
10 day : 1个 n
9 day: (1+1)*2 => (n+1)*2 
8 day: ((n+1)*2+1)*2
9 day: (((n+1)*2+1)*2+1)*2

"""


def calculate_peaches(day):
    if day == 10:
        return 1
    else:
        return (calculate_peaches(day + 1) + 1) * 2


classic_peaches = calculate_peaches(1)
print(f"第一天共摘了{classic_peaches}个桃子")
